<template>
  <div>
    <van-sticky>
      <van-nav-bar
          title="服务协议"
          left-arrow
          @click-left="onClickLeft"/>
    </van-sticky>
    <van-index-bar :index-list="indexList">
      <van-index-anchor index="1">用户协议</van-index-anchor>
      <van-index-anchor index="2">特别提醒</van-index-anchor>
      <van-cell
          title="黑龙江家信修美容有限公司，在此特别提醒您(用户)注册成为用户前，请仔细阅读本用户协议(以下简称“协议”)，确保您充分理解本协议中的条款。请您仔细阅读并选择接受或不接受本协议。除非您接受本协议的全部条款和条件，否则您无权注册、登录或使用本协议所涉及的服务。您的注册、登录、使用等行为将被视为接受本协议，并同意受本协议条款的约束。黑龙江家信修美有限公司与用户达成协议，约定“ETCC自助洗涤APP”软件服务(以下简称“服务”)的权利与义务。“用户”是指注册、登录、使用本服务的个人。本协议可对黑龙江家信修美容有限公司进行更新，一旦发布更新后的协议取代原有的协议条款，将不再另行通知，用户可在本网站查阅最新版本的协议条款。在黑龙江之家信用修复美容有限公司修改本协议条款后，如果用户不接受修改后的条款，请立即停止使用黑龙江之家信用修复美容有限公司提供的服务，用户继续使用黑龙江之家信用修复美容有限公司。服务将被视为接受修改后的协议。"/>
      <van-index-anchor index="3">一、账号注册</van-index-anchor>
      <van-cell
          title="1、用户在使用本服务前需要注册一个ETCC自助洗涤APP的账号。“ETCC自助洗涤APP”账号应使用捆绑注册的手机号，请使用用户尚未与“ETCC自助洗涤APP”账号绑定的手机号，且尚未被黑龙江家信修美容有限公司按照本协议禁用手机号注册的“ETCC自助洗涤APP”账号。黑龙江家信修美容有限公司可根据用户需要或产品要求进行账号注册及绑定方式变更，无需事先通知用户。"/>
      <van-cell
          title="2、鉴于“ETCC自助洗涤APP”账号绑定注册，您同意黑龙江之家信修美容有限公司，在注册时将向您提供使用的手机号码和/或自动提取您的手机号码，并自动提取您使用的移动设备识别号等信息进行注册。"/>
      <van-cell
          title="3、当用户注册并使用本服务时，黑龙江之家信用汽车维修美容有限公司需要收集个人信息以识别用户身份，以便黑龙江之家信用维修美容有限公司在必要时联系用户，或为用户提供更好的体验。黑龙江家信修美容有限公司，收集的信息包括但不限于用户的姓名、性别、身份证号码、地址、电话号码、所在地区;黑龙江家信修美业有限公司同意将本信息的使用限制在用户个人隐私信息保护第3条的约束下。"/>
      <van-index-anchor index="4">二、服务内容</van-index-anchor>
      <van-cell
          title="1、黑龙江家信汽车养护美容有限公司可变更其所提供的服务，且黑龙江家信汽车养护美容有限公司的服务内容可随时变更;用户将收到黑龙江家信修美容有限公司有关服务变更的通知。"/>
      <van-cell
          title="2、黑龙江家信修美容有限公司服务包括免费服务和收费服务。用户可以通过购买收费、付费的方式获得优质服务，黑龙江家信汽车养护美容有限公司会在用户使用前给用户一个明确的提醒，只有用户根据提示确认其同意付款并按照之前的付款行为完成付款，用户才可以使用付费服务。支付完成后以银行或第三方支付平台生成的“支付”已完成确认通知为准。三、用户个人信息的保护1、用户账号在使用或使用本服务的过程中，可能需要填写或提交一些必要的个人信息，如法律、法规、规范性文件(以下简称“法律、法规”)需要填写的身份信息。如果用户提交的信息不完整或不符合法律法规规定，用户可能无法使用本服务或在使用本服务的过程中受到限制。"/>
      <van-index-anchor index="5">三、用户个人信息保护</van-index-anchor>
      <van-cell
          title="1、用户账号在使用或使用本服务的过程中，可能需要填写或提交一些必要的个人信息，如法律、法规和规范性文件(以下简称“法律、法规”)规定需要填写的身份信息。如果用户提交的信息不完整或不符合法律法规规定，用户可能无法使用本服务或在使用本服务的过程中受到限制。"/>
      <van-cell
          title="2、用户个人信息包括:1)用户提供的个人信息(如注册填写电话号码、邮箱等个人信息，使用所提供的服务共享信息等);2)其他方共享用户个人信息;3)黑龙江省家信汽车养护美容有限公司依法提供服务并收集用户必要的个人信息(如使用本服务系统的自动数据采集设备或软件信息、浏览历史记录信息、通信时间信息等技术信息、用户在启动功能和使用本服务时的位置信息等)。个人隐私信息是指用户的个人身份信息或个人隐私信息，如用户的真实姓名、身份证号、电话号码、手机设备识别号、IP地址等，所述隐私信息是指用户对服务的操作状态和使用习惯等清晰、客观地反映在黑龙江基本之家信用修复美容有限公司。服务器记录的兴趣、个人隐私信息范围之外的其他常用信息，以及用户同意公开的上述隐私信息。黑龙江家信汽修美容有限公司保证在征得用户书面同意后，不会收集、使用或公开用户的个人隐私信息，用户同意黑龙江家信汽修美容有限公司。未经用户确认并授权收集、使用或披露用户个人隐私信息。"/>
      <van-cell
          title="3、尊重用户个人信息隐私是黑龙江极洽汽车养护美容有限公司的宗旨，黑龙江家信汽车养护美容有限公司将采取技术措施及其他必要措施确保用户个人信息安全，防止在本服务中收集用户个人信息的泄露、损害或丢失。在前述情况下或黑龙江之家信用修复美容有限公司，发现可能存在前述情况时，黑龙江之家信用汽车维修美容有限公司将及时采取补救措施并通知用户，用户应立即发现前述情况也联系黑龙江之家信用汽车维修美容有限公司。"/>
      <van-cell
          title="4、未经用户事先许可，不得向任何第三方公开用户隐私信息。除特定情况外:(1)黑龙江之家信用修复美容有限公司根据法律法规或有权提供用户个人隐私信息的权威机构的指示;(2)因客户将用户密码告知他人或与他人共享注册银行账号和密码，而导致的任何个人信息泄露，或其他不与黑龙江之家信用修复美容有限公司合作;(4)用户与维修黑龙江家信汽车美容有限公司、合作单位就某用户的个人隐私信息公开约定，黑龙江家信维修美容有限公司等合作单位公开用户隐私信息;(5)任何因黑客攻击、计算机病毒等不可抗力事件导致用户个人隐私信息泄露;(6)用户的个人信息已被处理，无法识别具体个人且无法恢复。"/>
      <van-cell
          title="5、用户同意黑龙江之家信用修复美容有限公司，可以使用以下用户的个人隐私信息:(1)黑龙江之家信用修复美容有限公司，向用户及时发送重要通知，如软件更新、本协议条款变更等;(2)黑龙江之家信用修复美容有限公司进行内部审计、数据分析研究等，以完善黑龙江之家信用汽车美容有限公司的产品;(3)本协议项下，黑龙江管家信用维修美容有限公司对用户信息的管理、审核及处理措施;(4)适用法律法规规定的其他事项。除上述事项外，如未事先征得用户同意，黑龙江家信修美业有限公司。不会将用户隐私信息用于任何其他目的。"/>
      <van-cell
          title="6、黑龙江家信汽车养护美容有限公司非常重视未成年人个人信息的保护。黑龙江家信修美业有限公司，将根据用户提供的个人信息来判断用户是否为未成年人。任何未满18周岁的未成年人开通账户或使用本服务应事先征得父母或法定监护人(以下简称“监护人”)的书面许可。此外，根据法律法规的规定，有权向有关部门的指示披露，黑龙江家信修美有限公司。不会使用或向任何第三方披露未成年人的聊天记录及其他个人信息。除本协议约定的例外情况外，未经监护人事先同意，黑龙江家信修美容有限公司不得擅自使用本协议约定的服务。不会使用或向任何第三方提供未成年人的个人信息。"/>
      <van-cell
          title="7、为了提高黑龙江之家信用修复美容有限公司的技术和服务水平，为客户提供更好的服务体验，黑龙江之家信用修复"/>
      <van-cell
          title="8、黑龙江之家信用汽车维修美容有限公司保证在合法、正当、必要的原则下收集、使用或公开用户的个人信息，不收集与用户提供的服务无关的个人信息。"/>
      <van-index-anchor index="6">四、内容规范</van-index-anchor>
      <van-cell
          title="1、本条所称内容是指用户在使用本服务过程中制作、上传、复制、分发、传播的任何内容，包括但不限于，账号图片、姓名、用户说明注册信息和认证信息，或文字、语音、图像、视频、图形、自动回复或回复消息发送和页面链接，以及使用其他账号或本服务内容的原始内容。"/>
      <van-cell
          title="2、用户不得利用“ETCC自助洗涤APP”账号或本服务系统，上传、复制、分发、传播下列内容，是法律、法规和政策所禁止的:(1)反对确定宪法基本原则的;(2)危害国家安全、泄露国家秘密、颠覆、破坏国家统一的;(3)损害国家荣誉和利益的;(4)煽动民族仇恨的;(5)破坏国家宗教政策，宣扬邪教和封建迷信的;(6)造谣惑众，扰乱社会秩序，破坏社会稳定的;(7)散布淫秽、色情、赌博、暴力、凶杀、恐怖、教唆犯罪的;(8)侮辱、诽谤他人，侵犯他人合法权益的;(9)不遵守法律、法规规定的底线、社会主义制度的底线、国家利益的底线、公民合法权益的底线、社会公共秩序的底线、道德底线的真实性的底线和信息要求的“七条底线”的;(10)含有法律、行政法规禁止的其他内容的信息。"/>
      <van-cell
          title="3、用户不得利用“ETCC自助洗涤APP”帐号或我们的服务，上传、复制、分发、传播、干扰“ETCC自助洗涤APP”的正常运营，以及侵犯其他用户或第三方合法权益的内容:(1)含有任何性、色情内容的;(2)含有辱骂、恐吓、威胁内容的;(3)含有骚扰、垃圾信息、恶意信息、引诱信息的;(4)涉及他人隐私的;个人信息或数据;(5)侵犯名誉权、形象权、知识产权、商业秘密等合法权利的;(6)含有其他干扰本服务正常运行和侵犯其他用户或第三方合法权益的内容信息。"/>
      <van-index-anchor index="7">五、使用规则</van-index-anchor>
      <van-cell
          title="1、用户在本服务或通过本服务传递的内容，不反映任何内容或代表，也不应被视为反映或代表黑龙江之家信用修复美容有限公司的立场或政策。本网站不承担任何责任。"/>
      <van-cell
          title="2、用户不得使用“ETCC自助洗涤APP”账号或服务进行以下行为:(1)提交、虚假信息，或文件图片、数据被盗、冒充、冒用他人名义;(2)强迫、诱导其他用户、点击链接页面或分享信息;(3)虚构事实、隐瞒真相误导他人;(5)利用“ETCC自助洗涤APP”账号或服务从事任何违法犯罪活动;(6)制作、发布与上述方法、工具有关的行为，或者操作、传播上述方法、工具，无论这些行为是否出于商业目的;(7)其他违反法律、法规规定的行为。"/>
      <van-cell
          title="3、用户必须对使用“ETCC自助洗车APP”账号或本服务传递信息的真实性、合法性、有效性、准确性负责，对用户信息传递所涉及的任何法律责任由用户自行承担;与黑龙江家信汽车养护美容有限公司无关。如因此给黑龙江家信修美业有限公司或第三方造成损害，用户应依法作出赔偿。"/>
      <van-cell
          title="4、黑龙江家信汽车养护美容有限公司提供的服务可能包括广告，用户同意在使用过程中显示黑龙江省家信汽车养护美容有限公司及第三方供应商、合作伙伴提供的广告。除法律法规另有明文规定外，用户应负责按照广告信息进行交易，对于按照广告信息进行交易给用户或广告商所提供内容所遭受的损失或损害，黑龙江家信汽车养护美容有限公司不承担任何责任。"/>
      <van-cell
          title="5、除非得到黑龙江之家信用修复美容有限公司的书面许可，否则用户不得从事下列任何行为:(1)删除本软件及其有关版权的拷贝信息;(2)对该软件进行反向工程、反向组装、反向编译，或以其他方式试图查找该软件的源代码;(3)对黑龙江之家信用修复美容有限公司所拥有的知识产权内容进行使用、出租、出借、复制、修改、链接;(4)在软件或软件运行过程中向任何终端发布内存数据、软件运行过程中客户端与服务器端交互的数据、必要的系统和软件运行数据，不得复制、修改、添加、删除、铰接运行或创作任何衍生作品，包括但不限于使用插件;(5)通过修改或伪造软件运行中的指令和数据，以及增加、删减、改变软件的功能或运行效果，或将其用于软件的目的、方法进行运行或向公众传播，无论这些行为是否用于商业目的;(6)通过黑龙江之家信用修复美容有限公司开发的、经黑龙江省授权的第三方软件、外挂、外挂、系统，登录或使用黑龙江之家信用修复美容有限公司的软件及服务，或生产、发行、传输黑龙江之家信用修复美容有限公司开发的、经授权的第三方软件、外挂、外挂、系统。"/>
      <van-index-anchor index="8">六、账户管理</van-index-anchor>
      <van-cell
          title="1、“ETCC自助洗涤APP”账户归属黑龙江家信修美有限公司所有用户通过申请注册手续，获得“ETCC自助洗涤APP”账号的各项权利，其使用权仅属于首次申请注册的用户，禁止捐赠、借用、出租、转让或出售。黑龙江家信修美有限公司因业务需要，有权回收用户“ETCC自助洗涤APP”账号。"/>
      <van-cell
          title="2、用户可以通过1)查看和编辑个人信息页面;2)在“设置”页面的“账号与安全”页面中可以查询、更改、删除、取消“ETCC自助洗涤APP”对账号的个人信息，转让注册信息和内容等，但注意它也会删除存储在系统中的用户文字和图片等相关信息。用户需要承担风险。"/>
      <van-cell
          title="3、用户有责任妥善保管账号信息和账号密码，妥善保管可能造成整体损失，因用户遭受黑客攻击或密码被盗，责任由用户自行承担。用户需要对注册帐号和密码的行为承担法律责任。用户同意在任何情况下不使用其他用户的账号或密码。对用户怀疑他人使用其账号或密码，用户同意及时通知黑龙江之家信用修复美容有限公司。"/>
      <van-cell
          title="4、用户应遵守本协议条款，正确、合理地使用本服务，如用户违反本协议的任何规定，黑龙江之家信用修复美容有限公司;在通知用户后，有权按照约定中断或停止为默认用户“ETCC自助洗涤APP”账号提供服务。同时，黑龙江家信修美有限公司储备随时收回“ETCC自助洗涤APP”账号、用户名权。"/>
      <van-cell
          title="5、如用户注册的“ETCC自助洗车APP”账号长时间未登录，在通知用户后，黑龙江家信汽车养护美容有限公司可收回该账号，以免造成资源浪费，由此产生的不良后果由用户自行承担。"/>
      <van-index-anchor index="8">七、数据存储</van-index-anchor>
      <van-cell title="1、黑龙江家信修美有限公司，不删除用户在本服务或店内出现的相关数据，概不负责。"/>
      <van-cell
          title="2、黑龙江家信修美业有限公司，可以根据实际情况在本服务中给用户的数据最长的存储期限，并在服务器上分配最大的数据存储空间等。用户可以根据自己的需要备份本服务中的数据。"/>
      <van-cell
          title="3、如用户停止使用本服务或终止本服务，黑龙江家信汽车养护美容有限公司可从服务器上永久删除用户数据。本服务停止，终止后，黑龙江家信修美容有限公司。没有义务向用户返回任何数据。"/>
      <van-index-anchor index="9">八、数据存储</van-index-anchor>
      <van-cell
          title="1、用户理解并同意，“ETCC自助洗涤APP”仅为用户提供信息共享、传递和访问的平台，用户必须对注册账号下的一切行为负责，包括任何内容的传递和由此产生的后果。用户对“ETCC自助洗涤APP”所响应的内容及服务内容的自行判断，并承担因使用内容而产生的一切风险，包括对于内容的正确性、完整性或实用性所依赖的风险。黑龙江家信修美有限公司不能也不会对因用户行为造成的任何损失或损害负责。如果用户发现任何人违反本协议或以其他不正当手段使用本服务，请立即向黑龙江家信修车美有限公司举报或投诉，黑龙江家信修车美有限公司将按照本协议进行处理。"/>
      <van-cell
          title="2、用户理解并同意，因业务发展需要，黑龙江家信修复美容有限公司。保留本服务上全部或部分服务内容单方面变更、暂停、终止或取消的权利，用户需要自行承担该风险。"/>

      <van-index-anchor index="10">九、知识产权声名</van-index-anchor>
      <van-cell
          title="1、除本服务所涉及的知识产权均由相应广告主拥有广告外，黑龙江之家信修美容有限公司，在本服务中所提供的内容(包括但不限于网页、文字、图片、音频、视频、图形等)的知识产权均归黑龙江之家信修美容有限公司所有;但用户在使用本服务前对其内容已合法取得的知识产权除外。"/>
      <van-cell
          title="2、除特别注明外，黑龙江家信修美有限公司提供本服务所依赖的软件著作权、专利等知识产权均归黑龙江家信汽车维修美容有限公司所有。"/>
      <van-cell
          title="3、黑龙江家信维修美容有限公司，所涉及的服务图形、文字，或其组成部分，以及其他黑龙江家信维修美容有限公司的标志、产品、服务名称，(以下统称“黑龙江家信维修美容有限公司”)。标识”)，其版权或商标归黑龙江家信汽车养护美容有限公司所有。未经黑龙江之家信用修复美容有限公司事先书面同意，用户不得为黑龙江之家信用修复美容有限公司用户。徽标不得以任何方式展示或使用或进行其他处理，或向他人表明用户有权展示、使用或经其他授权处理黑龙江家信修美容有限公司徽标的行为。"/>
      <van-cell
          title="4、以上内容与任何其他家信汽车维修美容有限公司在黑龙江省依法或相关广告主拥有的知识产权均受法律保护，未经黑龙江家信汽车维修美容有限公司或相关广告主书面许可，用户不得以任何形式使用或创作衍生作品。"/>
      <van-index-anchor index="11">十、法律责任</van-index-anchor>
      <van-cell
          title="1、如果黑龙江家信修美有限公司发现或收到他人举报投诉或用户违反本协议，黑龙江家信汽车养护美容有限公司有权在不另行通知的情况下随时对相关内容，包括但不限于对用户的个人资料、聊天记录进行审查、删除，并视违法行为的严重程度对账号进行包括但不限于警告、账号封禁处罚、设备封禁、功能封禁，并通知用户。"/>
      <van-cell
          title="2、被禁用户到黑龙江家信修美容有限公司。网站页面提交投诉，黑龙江家信修美业有限公司将对申诉进行审查，并作出合理判断，决定是否变更处罚。"/>
      <van-cell
          title="3、用户理解并同意，黑龙江爱美汽车养护有限公司有权根据合理判断对违反相关法律法规或本协议规定的行为进行处罚，对违反任何用户行为采取适当的法律行动，按法律法规保留相关资料向有关部门报告等，用户自行承担一切法律责任和责任。"/>
      <van-cell
          title="4、用户理解并同意，违反本协议，对任何第三方产生的索赔或任何索赔、要求或损失，包括合理的律师费，用户应向黑龙江家信修美容有限公司赔偿。并与合作公司、联营公司合作，使其免受损害。"/>
      <van-index-anchor index="12">十一、不可抗力及其他免责事由</van-index-anchor>
      <van-cell
          title="1、用户理解并确认，在使用本服务的过程中，可能会遇到不可抗力等风险因素，使本服务中断。不可抗力是指任何不能预见、不能克服、不可避免并对一方或双方产生重大影响的外部事件，包括但不限于洪水、地震、瘟疫、风暴等自然灾害和战争、动乱、政府行为等社会事件。出现这种情况，黑龙江家信修美有限公司。将尽量在第一时间配合有关单位，及时修复，但给用户或第三方造成的损失，黑龙江家信修复美容有限公司及合作伙伴在法律允许的范围内承担责任。"/>
      <van-cell
          title="2、本服务与大多数互联网服务一样，包括但不限于用户原因、网络服务质量差异、社会环境等因素，都可能受到各种安全问题的影响，如他人从用户的信息中获取，造成现实生活中的骚扰;其他用户下载安装的软件或访问其他含有病毒的网站，如“特洛伊木马”威胁用户计算机信息和数据的安全，进而影响服务的正常使用等。用户应加强信息安全和用户信息保护意识，注意加强密码保护，免遭丢失和骚扰。"/>
      <van-cell
          title="3,用户理解并确认,该服务存在因不可抗力、计算机病毒或黑客攻击、系统不稳定、用户的位置、用户关机以及其他任何技术,如互联网、通信线路造成的服务中断或不能满足用户要求的风险,从而导致用户或第三方对任何损失,黑龙江住房信贷汽车保养和美容有限公司有限公司不承担任何责任。"/>
      <van-cell
          title="4、用户了解并确认，在使用本服务的过程中存在来自任何他人的包括误导性、欺诈性、威胁性、诽谤性、攻击性、或非法信息，或侵犯他人匿名或假名信息的权利，以及使用该等信息的行为，从而导致用户或第三方遭受任何损失，黑龙江家信汽车养护美容有限公司不承担任何责任。"/>
      <van-cell
          title="5、用户了解并确认，黑龙江之家信用汽车维修美容有限公司需要定期或不定期对“ETCC自助洗车APP”平台或相关设备进行维护/维修或在合理时间内中断服务等情况，黑龙江之家信用汽车维修美容有限公司不需要对此承担任何责任，但黑龙江之家信用汽车维修美容有限公司应提前通知。"/>
      <van-cell
          title="6、黑龙江之家信修美容有限公司根据法律法规，获得本协议对违法或违约内容的处理权利，该权利不构成黑龙江之家信修美容有限公司的义务，也不构成黑龙江之家信修美容有限公司的承诺，黑龙江之家信修美容有限公司不保证及时发现违规或违约或进行相应处理。用户了解并确认，对于黑龙江之家信用修复美容有限公司为客户提供的下列产品或服务的质量缺陷及造成的任何损失，黑龙江之家信用修复美容有限公司，不承担任何责任:(1)黑龙江之家信用修复美容有限公司，免费向用户提供服务;(2)黑龙江之家信用汽车给予用户的任何保养美容有限公司的产品或服务。"/>
      <van-cell
          title="7、在任何情况下，黑龙江之家信修美容有限公司不承担任何间接的、后果性的、惩罚性的、附带的、特殊的或惩罚性的损害，包括因用户使用“ETCC自助洗涤APP”而遭受的损失或因使用本服务而产生的利润，承担任何责任(即使黑龙江之家信修美容有限公司已被告知此类损失的可能性)。尽管本协议的条款可能包含价值，黑龙江之家信用修复美容有限公司，承担用户的责任，无论何种行为，或出于何种原因，始终少于用户通过使用黑龙江之家信用修复美容有限公司，提供的服务和支付黑龙江之家化妆品有限公司，信用修复的费用(如有)。"/>

      <van-index-anchor index="13">十二、服务的变更、中断、终止</van-index-anchor>
      <van-cell
          title="1、鉴于网络服务的特殊性，用户同意黑龙江家信修美容有限公司有权随时变更、中断或停止部分或全部服务(包括服务费)。"/>
      <van-cell
          title="2、发生下列情形之一的，黑龙江之家信用修复美容有限公司有权变更、中断或停止为客户提供的免费服务或收费服务;无需对用户或任何第三方承担任何责任:(1)依法应提交的用户真实信息，且用户提供的个人资料不真实;或不同意注册信息且未能提供合理证明的;(2)用户违反有关法律法规或本协议的规定的;(3)根据法律要求或有权授权的;(4)出于安全原因或其他必要条件的。"/>
      <van-index-anchor index="14">十三、其他</van-index-anchor>
      <van-cell
          title="1、黑龙江家信汽修美容有限公司正式提醒用户，本协议中免除了黑龙江家信汽修美容有限公司对用户权利的责任和限制条款，用户请仔细阅读，独立考虑风险。未成年人应在法定监护人陪同下阅读本协议。"/>
      <van-cell
          title="2、本协议的效力、解释及争议的解决，均适用中华人民共和国法律。如用户与黑龙江之家信用修复美容有限公司之间发生任何争议或纠纷，首先应通过友好协商解决，协商不成的，用户同意将争议或提交黑龙江之家信用修复美容有限公司处理。有管辖权的人民法院的管辖权。"/>
      <van-cell title="3、本协议的任何条款，无论因何种原因无效或无强制执行力，其余条款仍然有效并对双方具有约束力。"/>
    </van-index-bar>
  </div>
</template>
<script>
export default {
  name: "ServiceAgreement",
  setup() {
    const onClickLeft = () => history.back();
    return {
      onClickLeft,
    };
  },
  data() {
    return {
      indexList: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14],
    };
  },
}
</script>
<style scoped>
.van-index-anchor {
  z-index: 1;
  box-sizing: border-box;
  padding: 0 16px;
  color: #323233;
  font-weight: 500;
  font-size: 14px;
  line-height: 32px;
  text-align: left;
  background-color: transparent;
}

.van-cell {
  position: relative;
  display: -webkit-box;
  display: -webkit-flex;
  display: flex;
  box-sizing: border-box;
  width: 100%;
  padding: 10px 16px;
  overflow: hidden;
  color: #323233;
  font-size: 14px;
  line-height: 24px;
  text-align: left;
  background-color: #fff;
}
</style>